# Uber Project
Analysis hot zone for Uber taxi pickup to be closed to users at mean 5-7 minutes. #block3

**Goal** :
Uber already has data about pickups in major cities. Your objective is to create algorithms that will determine where are the hot-zones that drivers should be in. Therefore you will:

> Create an algorithm to find hot zones; \
> Visualize results on a nice dashboard.

## EDA

In [7]:
# import
import os
import json
import pandas as pd
import seaborn as sns
import geopandas as gpd 
from module import helper

%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [4]:
# sns 
color_palette = ['#265952', '#DFCEEB', '#DBDE2F', '#45201E', '#c7ac92', '#a44a3f']
sns.set_palette(sns.color_palette(color_palette))

### load data
We'll simplify the project and read only one dataset in New York city.

In [5]:
# read apr14 dataset & taxi zone lookup
uber_raw_apr14 = "../data/raw/uber-raw-data-apr14.csv"
uber_taxi_lookup = "../data/raw/taxi-zone-lookup.csv"

df_uber_apr14_raw = pd.read_csv(uber_raw_apr14)
df_uber_lookup_raw = pd.read_csv(uber_taxi_lookup)

### general statistics

In [8]:
# general statistics
print("Uber raw April 2014 New york city : Stats :")
helper.general_statistics(df_uber_apr14_raw)

Uber raw April 2014 New york city : Stats :
Number of rows : 564516

Display of dataset:

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

Basics statistics:

                Date/Time            Lat            Lon    Base
count              564516  564516.000000  564516.000000  564516
unique              41999            NaN            NaN       5
top     4/7/2014 20:21:00            NaN            NaN  B02682
freq                   97            NaN            NaN  227808
mean                  NaN      40.740005     -73.976817     NaN
std                   NaN       0.036083       0.050426     NaN
min                   NaN      40.072900     -74.773300     NaN
25%                   NaN      40.722500     -73.997700     NaN
50%                   NaN      40.742500     -73.984800     NaN
75%                   NaN      40.760700     -73.970000     NaN
max                   NaN      42.116600     -72.066600     NaN

General information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  564516 non-null  object
 1   Lat        564516 non-null  float64
 2   Lon        564516 non-null  float64
 3   Base       564516 non-null  object
dtypes: float64(2), object(2)
memory usage: 17.2+ MB

None

Percentage of missing values:

Date/Time    0.0
Lat          0.0
Lon          0.0
Base         0.0
dtype: float64

In [14]:
df_uber_apr14_raw.groupby("Base").size()

Base
B02512     35536
B02598    183263
B02617    108001
B02682    227808
B02764      9908
dtype: int64

In [15]:
# general statistics
print("Uber taxi lookup New york city : Stats :")
helper.general_statistics(df_uber_lookup_raw)

Uber taxi lookup New york city : Stats :
Number of rows : 265

Display of dataset:

   LocationID        Borough                     Zone
0           1            EWR           Newark Airport
1           2         Queens              Jamaica Bay
2           3          Bronx  Allerton/Pelham Gardens
3           4      Manhattan            Alphabet City
4           5  Staten Island            Arden Heights

Basics statistics:

        LocationID Borough                                           Zone
count   265.000000     265                                            265
unique         NaN       7                                            261
top            NaN  Queens  Governor's Island/Ellis Island/Liberty Island
freq           NaN      69                                              3
mean    133.000000     NaN                                            NaN
std      76.643112     NaN                                            NaN
min       1.000000     NaN                                            NaN
25%      67.000000     NaN                                            NaN
50%     133.000000     NaN                                            NaN
75%     199.000000     NaN                                            NaN
max     265.000000     NaN                                            NaN

General information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LocationID  265 non-null    int64
 1   Borough     265 non-null    object
 2   Zone        265 non-null    object
dtypes: int64(1), object(2)
memory usage: 6.3+ KB

None

Percentage of missing values:

LocationID    0.0
Borough       0.0
Zone          0.0
dtype: float64

### visualization